Repository: 5l1v3r1/wireshark-plugin-afdx
Catalog: po/*.po
Languages: ru

source: (MTU: %d bytes; BAG: %d us; Jitter: %d us)
ru: (MTU: %d байт; BAG: %d мкс; Jitter: %d мкс)

source: (Unknown VL ID)
ru: (Неизвестный VL ID)

source: %d.%06d ms
ru: %d.%06d мс

source: , Iface: %s
ru: , Интерф.: %s

source: A CSV file containing VL ID, MTU, BAG and Jitter for each virtual link
ru: CSV-файл, содержащий значения VL ID, MTU, BAG и Jitter для каждого виртуального канала

source: A CSV file containing min dst MAC, max dst MAC, Equipment name and Application name for each equipment and application
ru: CSV-файл, содержащий мин. MAC-адрес приёмника, макс. MAC-адрес приёмника, Обозначение оборудования, Обозначение приложения для каждого элемента оборудования и приложения

source: A file with the list of valid VL ID ranges for this interface
ru: Файл со списком корректных диапазонов VL ID для этого интерфейса

source: A table with names of files with valid VL ID ranges for each interface
ru: Таблица имен файлов диапазонов корректных VL ID для каждого интерфейса

source: AFDX interface identifier (1 - network A, 2 - network B)
ru: Идентификатор интерфейса (1 - сеть A, 2 - сеть B)

source: Application
ru: Приложение

source: Application name based on MAC destination
ru: Имя приложения, полученное по MAC-адресу приёмника

source: Assume AFDX packets have FCS
ru: Считать, что пакеты AFDX имеют поле FCS

source: Check FCS for AFDX packets
ru: Проверять FCS для пакетов AFDX

source: Destinaion device ID
ru: Идент. оборудования

source: Destinaion device direction
ru: Идент. стороны

source: Destinaion device location
ru: Идент. местонахождения

source: Destinaion network ID
ru: Идент. раздела

source: Destination IP
ru: IP-адрес приёмника

source: Destination IP is neither Class A nor Class D
ru: IP приёмника не принадлежит ни классу A, ни классу D

source: Destination MAC
ru: MAC-адрес приёмника

source: Destination MAC equipment table
ru: Таблица оборудования и приложений MAC

source: Enable AFDX dissection
ru: Разрешить разбор Ethernet-кадров как AFDX

source: Equipment
ru: Оборудование

source: Equipment name based on MAC destination
ru: Имя оборудования, полученное по MAC-адресу приёмника

source: Ethernet checksum
ru: Контрольная сумма протокола Ethernet

source: Frame check sequence
ru: Контрольная сумма кадра

source: Frame counter
ru: Счетчик кадров

source: Frame number error
ru: Ошибка в номерах кадров

source: Frame number gap: previous: %d, current: %d
ru: Пропуск в номерах кадров: предыдущий: %d, текущий: %d

source: Frame size exceeds MTU
ru: Размер кадра превышает MTU

source: Frame size larger than MTU: frame size = %d bytes > %d bytes = MTU
ru: Размер кадра превышает MTU: размер кадра = %d байт > %d байт = MTU

source: Hardware interface
ru: Аппаратный интерфейс

source: If enabled, all UDP frames are interpreted as AFDX (rather than plain Ethernet)
ru: Если включено, все Ethernet-кадры, содержащие UDP, интерпретируются как кадры AFDX (а не как кадры обычного Ethernet'а)

source: If enabled, assume that all AFDX packets have Frame Check Sequence
ru: Если выбрано, считать, что все пакеты AFDX имеют поле контрольной суммы кадра (Frame Check Sequence)

source: If enabled, check FCS for AFDX packets
ru: Если выбрано, проверять правильность контрольной суммы в поле FCS для пакетов AFDX

source: Incorrect FCS
ru: Неправильная контрольная сумма кадра

source: Incorrect Virtual Link ID for this interface
ru: Некорректный VL ID для этого интерфейса

source: Interface ID
ru: ID интерфейса

source: Interface name
ru: Имя интерфейса

source: Invalid
ru: Некорректное значение

source: Parameters of Virtual Links
ru: Параметры виртуальных каналов

source: Partition ID
ru: Идент. раздела

source: Sender Device ID in IP doesn't match Sender Device ID in MAC
ru: Идент. оборудования в MAC-адресе источника не совпадает с идент. оборудования в IP-адресе отправителя

source: Sender Network ID in IP doesn't match Sender Network ID in MAC
ru: Идент. сети в MAC-адресе источника не совпадает с идент. сети в IP-адресе отправителя

source: Sender device ID
ru: Идент. оборудования

source: Sender device direction
ru: Идент. стороны

source: Sender device location
ru: Идент. местонахождения

source: Sender network ID
ru: Идент. сети

source: Sender partition ID
ru: Идент. раздела

source: Source IP
ru: IP-адрес отправителя

source: Source IP is not Class A
ru: IP-адрес отправителя не принадлежит классу A

source: Source MAC
ru: MAC-адрес источника

source: The hardware interface where the packet was actually captured
ru: Аппаратный интерфейс, с которого был получен кадр

source: Time delta for previous packet of same VL
ru: Промежуток времени от предыдущего кадра данного VL

source: Unknown Virtual Link ID
ru: Неизвестный VL ID

source: VL BAG violation
ru: Нарушение интервала BAG

source: VL BAG violation: delta = %d.%06d ms < %d.%06d ms = BAG - Jitter
ru: Нарушение интервала BAG для данного VL: delta = %d.%06d мс < %d.%06d мс = BAG - Jitter

source: VL ID in dst IP does not match VL ID in dst MAC
ru: VL ID в IP-адресе приёмника не совпадает с VL ID в MAC-адресе приёмника

source: VL ID list filename
ru: Имя файла списка VL ID

source: Valid VL range not specified for this interface
ru: Диапазон корректных VL ID не задан для этого интерфейса

source: Valid VL table
ru: Таблица корректных VL ID

source: Valid VLs
ru: Корректные VL ID

source: Virtual Link Identifier
ru: Идентификатор виртуального канала

source: correct
ru: правильная

source: incorrect, should be:
ru: неправильная, должно быть:

source: validation disabled
ru: проверка отключена
